[
    {
        "title": "How to create a website for your business in just 10 min",
        "chunk_index": 0,
        "text": "How to create a website for your business in just 10 min\nApril 27, 2018\nJamse\nCreate your new business website fast and easy! Go to\nNinjamock.com\nand claim your Free or Pro Account to follow the tutorial on how to create a website for your business in just 10 min. In case you wish to download and reuse this project for your own website, it is available from our\nSamples\n. It is fun and easy and you do not have to be very technical skilled. Follow a long and you will be proud of your result!\nWhat is a wireframe?\nA wireframe is a drawing of how you want, in this case, your business website to look and how users are supposed to click through it. You use a wireframe for yourself to get clear about where you want text, images, navigation etc. to be positioned on your page. You also use it to get clear about the user flow of your website. How are your customers supposed to navigate through your website? This means that you will gain an overview of all the pages that will make up your finished website.\nWhy should I bother to create a wireframe drawing?"
    },
    {
        "title": "How to create a website for your business in just 10 min",
        "chunk_index": 1,
        "text": "Creating a wireframe, like we do in this tutorial, allows you to get very specific about how you want the design of your business webpage. This forces you to think about the user experience early in the process. But why not just go to a designer or programmer to begin with and let them figure it out, you may think? Well Whether you contact a designer or programmer physically or online, they will need some sort of specification from you. They will need to know what you want. And if you are too abstract and do not know exactly yourself what it is that you want, the process is going to be a lot more expensive, than if you had a finished wireframe that you could just hand over. In the later case, this would make it possible for a designer and programmer to give you a price up front and you would be able to choose the best offer presented. With this method you will avoid surprises both in terms of the finished product and the price. Changing a website that is already coded is a lot more time consuming hence expensive, than changing a wireframe drawing. Should the designer or programmer have any comments on your wireframe, you can easily edit it together. Trough NinjaMock you can invite them to edit your website project. This means that you can discuss and agree on what is going to be created, before starting. Getting the functionality and the user flow of your business website right the first time, will make the process pleasant for all parties involved. It will save you time and money and you make sure that you get the business website that you want. So let’s get started and show you how to create a website for you business in no time!"
    },
    {
        "title": "How to create a website for your business in just 10 min",
        "chunk_index": 2,
        "text": "How to create a website for your business in just 10 min (1)\nIn this first part of the 3 step tutorial we will show you the business website that we are going to create. And we will show how to create the front page of our website. Follow along and you will have your own website in no time!\nHow to create a website for your business in just 10 min (2)\nContinuing where we left of in part 1, we will create our service or product page. Hang in there you are almost at the finish line!\nHow to create a website for your business in just 10 min (3)\nFinally we will create our “about us” page and link all our pages together to a finished wireframe.\nCongratulations. You now have a finished website wireframe!\nYou are as close to the real thing as one can be. You now know exactly what you want your website to look like and how it should be linked together. This gives you the opportunity to make a good deal with a programmer and designer, as your wireframe works as a blueprint for what they need to create. This means that your website will be up running in no time!\nIf you want to start a business, These post may also be of interest to you:\nUse wireframing to go from idea to business - fast.\nand\nImagination and action\n– The magic ingredients in entrepreneurship\nStart designing your business website!\nHappy Creating\nThe NinjaMock Team"
    },
    {
        "title": "How to create a shopping app in just 10 min!",
        "chunk_index": 0,
        "text": "How to create a shopping app in just 10 min!\nApril 17, 2018\nJamse\nFollow this 3 step tutorial on how to create a shopping app and you will have a finished app in no time!\nThe fastest process of creating an app is to:1) create a wireframe for your shopping app. A wireframe is a drawing of how you want your shopping app to look in terms of images, text, navigation etc. It also shows how you want users to navigate through different pages of your app. This is what we are producing in this 3 step tutorial. 2) The next step for you is to take this wireframe to a web designer and programmer. Having your wireframe gives them a very clear understanding of the end product that you want. This clarity makes their job easier by saving them time. For you time saved on programming and design saves you money. It is a win-win situation. You can find web designers for logo and web layout on platforms such as 99designs.com and programmers on platforms such as freelancer.com, toptal.com or gigster.com. 3) Enjoy your new shopping app!\nTo follow along the tutorial,\ncreate your own NinjaMock account\nand\nstart designing!\nWe offer both FREE and PRO accounts depending on your needs. It is fast an easy.\nIf you just want to use this shopping app project as your template and add additional pages to make it fit your business. Go to our"
    },
    {
        "title": "How to create a shopping app in just 10 min!",
        "chunk_index": 1,
        "text": "samples\npage, download and import the project to your own account.\nHow to create a shopping app in 10 min. (1)\nIn the first part of the “how to create a shopping app”, we are showing you all the pages that makes up the finished app. After this we are going to create the pages step by step. Follow along in your own pace and you will soon have your shopping app.\nHow to create a shopping app in 10 min. (2)\nIn the second part of the tutorial we are continuing where we left. We are creating additional app pages. Hang in, your are almost there!\nHow to create a shopping app in 10 min. (3)\nIn the final and last part of the tutorial we are creating our final pages. Finally. We are showing you have to link all the pages together and you will have a finished shopping app wireframe. Congratulations!\nCongratulations on your Shopping App wireframe!\nYou are now as close to a finished shopping app as anyone can be. You can now export it as a PDF and upload it on one of the platforms mentioned earlier, along with your design wishes. You can also give your selected web designer and programmer access to your project directly in NinjaMock via a link. Moreover, It is possible to export a project as a HTML coding file, which may make the job easier for your programmer to save even more time."
    },
    {
        "title": "How to create a shopping app in just 10 min!",
        "chunk_index": 2,
        "text": "Using a wireframe tool like NinjaMock ensures that you become clear about how your shopping app should look like and how users should be able to navigate through it. It gives you the best conditions for making a good deal and saves you time and money during the next state of developing the shopping app. For inspiration about wireframes in relation to starting a company, you may also read the article\nDreamers who Do\n.\nStart designing your shopping app today!\nHappy creating,\nThe Ninjamock Team"
    },
    {
        "title": "Are you a Programmer? Avoid headache using a simple wireframe tool",
        "chunk_index": 0,
        "text": "Are you a Programmer? Avoid headache using a simple wireframe tool\nApril 12, 2018\nJamse\nAvoid headache using a simple wireframe tool to make your coding more effective. Get feedback from clients and users, before starting to code, as it is much faster and easier to iterate a wireframe, than having to re-write your entire code.\nSome say that the lazy programmer is the best programmer, why spend unnecessary time on coding, if you could be more effective? Whether you are collaborating with a team or it is just you and the client, using a simple wireframe tool is the key to using your time most effectively and getting satisfied clients.\nNinjaMock makes you easily create, collaborate with colleagues in real time, share with clients and run user tests, before coding. Don’t worry, you’ll have full control over your project, assigning different roles to your team, such as “admin”, “designer” and “reviewer”.\nHaving a wireframe that has been user tested and approved by the client works as a blueprint for your code. It gives you an idea about where divs, headers, navs, images etc. are going to be. Follow this and you will be much more effective with your time, avoiding the headache of rewriting code, due to dissatisfied clients. To sum up, we have listed 6 reasons why wireframing is a must.\nWhy using a simple wireframe tool is a must for programmers:"
    },
    {
        "title": "Are you a Programmer? Avoid headache using a simple wireframe tool",
        "chunk_index": 1,
        "text": "Using a wireframe saves you time and headache by improving your workflow.\nUsing a simple wireframe tool like NinjaMock allows for real time collaboration.\nUsing a NinjaMock wireframe editor makes it possible to get client and user feedback within the application, ultimately creating better apps and websites.\nHaving a wireframe that is approved by the client and its users, works as a blueprint and plan of how to start coding most effectively.\nUsing a simple wireframe tool makes it possible to experiment with different structures, trying out different ideas, while they are easy to iterate, not wasting time coding the wrong thing.\nLastly, creating wireframes is easy and fun to do.\nStart Designing! Make your work flow even more effective by using our\ntemplate pages\nor ready made projects from our\nSamples\npage.\nHappy Creating!\nThe NinjaMock Team"
    },
    {
        "title": "Wireframe for Education – Create excitement and foster communication and team collaboration using an easy wireframe tool",
        "chunk_index": 0,
        "text": "Wireframe for Education – Create excitement and foster communication and team collaboration using an easy wireframe tool\nApril 5, 2018\nJamse\nAt NinjaMock we believe that learning must be fun, inspiring and playful, building confidence and adding a feeling of progress and success to the students. Most of us remember that special teacher, who was really into what he or she was teaching and walked that extra mile to inspire and encourage us as students, to develop our skills in a fun and interesting way.\nUsing an easy wireframe tool like NinjaMock provides an opportunity to create excitement among students, whether the topic would be within design, coding, innovation and entrepreneurship, product development – or simply just for the fun of creating.\nWorking with a simple wireframe tool is also great for team collaboration, as it allows the team to make ideas tangible, to facilitate communication, discussing pros and cons of different ideas and designs, allowing them to work through a design problem, taking different perspectives into consideration. Additionally, all team members are able to visualize their own ideas and the group can later take the best design pages from different team members and put it into one, ultimately exploiting all ideas of the group, ensuring to select the best possible solution.\nWhy use an easy wireframe tool for education?\nUse an easy wireframe tool to create a feeling of excitement and bring out the passion and drive in your students.\nWorking in a wireframe editor provides a playful environment encouraging creation.\nIt brings out the\njoy"
    },
    {
        "title": "Wireframe for Education – Create excitement and foster communication and team collaboration using an easy wireframe tool",
        "chunk_index": 1,
        "text": "of progressing in your students, seeing their ideas come to life throughthe finished wireframe designs.\nIt fosters communication, collaboration and ideation, creating together in teams.\nIt builds confidence and a feeling of pride, being able to share their wireframe designs with the world.\nAs the professor or teacher you can be set as “reviewer” and give feedback on the wireframe design within the NinjaMock wireframe editor.\nIt works as an eyeopener, “if I can create this, what else can I create?\nUsing an easy wireframe tool to facilitate learning through playful experimentation\nNinjaMock provides a simple and playful environment for exploring creativity, collaboration, experimenting and learning, allowing students to develop skills and confidence within ideation and creation of wireframe designs.\nUsing an easy wireframe tool like NinjaMock encourages and empowers people to create. No doubt, that this will be a super cool and exciting learning experience for your students. This is a chance to experiment and play.\nLet the creativity flow – Start Designing!\nHappy Creating,\nThe NinjaMock Team"
    },
    {
        "title": "Dreamers who Do – Imagination, Action, the Magic Ingredients in Entrepreneurship",
        "chunk_index": 0,
        "text": "Dreamers who Do – Imagination, Action, the Magic Ingredients in Entrepreneurship\nMarch 27, 2018\nJamse\nAre you an aspiring entrepreneur? Entrepreneurs are often described as dreamers who do. In this article we highlight the magic ingredients of entrepreneurship as imagination and action. Later, we explain how you can use simple wireframe software, to visualize ideas and transform dreaming into action.\nEntrepreneurs are dreamers who do\nEntrepreneurs have often been described as “dreamers who do” and this is a very fitting description looking at the current available knowledge within the field of entrepreneurship. Despite different approaches to entrepreneurial opportunities as being either “recognized”, “discovered” or “created” ranging from incremental to radical innovation, all views of entrepreneurial opportunities require the following magic ingredients”:\n“ the necessity to make decisions and take action often only based on human imagination and aspirations, that may or may not in time lead to new products, firms and markets” ( Saras D. et al. 2003)"
    },
    {
        "title": "Dreamers who Do – Imagination, Action, the Magic Ingredients in Entrepreneurship",
        "chunk_index": 1,
        "text": "Now let’s just take a moment to let this resonate. The magic ingredient to entrepreneurial activity is the ability to imagine what could be, to visualize it and believe in it so much, that your are willing to make decisions and act according to an imagined future outcome, well-knowing that your effort may or may not bare fruit. This on one hand seems a bit risky, and the more radical the idea, the greater risk. However, at the same time, what an encouraging and exciting fact this is, that human imagination, the ability to see what could be and make decisions and act according to it, is the magic ingredient of entrepreneurship. This highlights the importance of using visualization tools to make the imagined tangible and to be able to share your vision with future team members, strategic partners, future customers and investors.\nThe power of imagination – Use visualization tools to bridge imagination and action\nVisualization is the most powerful method to translate imagined ideas and manifest them in real life. You can do this by using a wireframe software for, app and website ideas. This allow you to share your vision and take the first step to realizing the idea.\nHow to improve your ideation process – using wireframe software"
    },
    {
        "title": "Dreamers who Do – Imagination, Action, the Magic Ingredients in Entrepreneurship",
        "chunk_index": 2,
        "text": "Great Ideas, seldom appear in a clear holistic way and often require a number of different choices along the process. thinking is not enough, you will reach better outcomes by experimenting and testing different ideas. Visualizing and communicating pros and cons with your team or stakeholders and reviewing ideas from different perspectives. Dive into the process and work your way through the different options provided in the contributing team or stakeholders, you can select the best possible ideas, user flows and designs.\nFacilitate communication through wireframing\nVisualizing facilitates communication and create a common framework for team collaboration. Additionally, getting more ideas into play, involving more stakeholders only heightens the quality of the ideation process, allowing you to create apps and website concepts, that is difficult to create on your own.\nUse wireframe software to tricker action\nStart by designing a wireframe and continually test your idea with stakeholders and customers. The wireframe is a blueprint for what needs to be designed and programmed. Wireframing is the fastest method for realizing ideas, as it allows you to make the imagined tangible, test, co-create and verify ideas, before any economic investment.\nUse wireframe software to reduce risk\nEntrepreneurs are risk averse"
    },
    {
        "title": "Dreamers who Do – Imagination, Action, the Magic Ingredients in Entrepreneurship",
        "chunk_index": 3,
        "text": "The last sentence of the statement saying; “that may or may not in time lead to new products, firms and markets(Saras D. et al 2003)” suggest that there is certain risk involved. You act upon a perceived opportunity and there is no guarantee of success. However, entrepreneurs are not “risk takers” as many mistakenly believe. They are rather risk averse, acknowledging risk as part of the game, but trying to limit it in any way possible. They work with “affordable loss” – how much am I willing to potentially lose if this does not work out?\nTest ideas before investing\nUsing wireframe software allows you to quickly visualize and test ideas. Check if there is a market, before you invest big money in realizing the project. A good idea is only good if there enough people that will spend money on it\nAs an entrepreneur time is your most valuable asset. This makes wireframes a desirable method, for testing ideas and markets, as it is a cheap and risk free.\nGet green light from customers\nIf your wireframe gets positive response from customers, you can use it to seek funding, as you can present the wireframe to investors and include positive customer reviews. Investors will have tangible product and live customer recommendations,as a basis for their investment decision. So if you\nwant to start a business\n, start with wireframing.\nGot any ideas you want to test? Start Designing!\nBest of Luck,\nThe NinjaMock Team"
    },
    {
        "title": "Dreamers who Do – Imagination, Action, the Magic Ingredients in Entrepreneurship",
        "chunk_index": 4,
        "text": "* Saras D. et al. (2003) Three Views of Entrepreneurship, Handbook of Entrepreneurship Research, 141-160, Great Britain, Kluwer Academic Publishers."
    },
    {
        "title": "Wireframe for Business – Use Wireframe Tools to Facilitate Your Product Design Process",
        "chunk_index": 0,
        "text": "Wireframe for Business – Use Wireframe Tools to Facilitate Your Product Design Process\nMarch 23, 2018\nJamse\nUsing wireframe tools, lets your company reduce cost and risk, while bringing your product to market fast!\nWireframe tools are used by business owners, innovation consultants and product managers. They use a wireframe tool to facilitate the product design process. Using a wireframe tool help companies bring their product to market fast. It is a cheap and risk free method, which makes it highly attractive for project management.\nWhat is a wireframe?\nImagine that your company is going to design a website or an app – what do you you want to achieve with this app or website? Then you may draft your initial idea using pen and paper. You draw the index page and decide where you want pictures, headings, text boxes, buttons and navigation to be located on the page. You continue to design more pages, that users can navigate to and decide the layouts of these too. With this method you will get an overview of how users are able to navigate within your app or webpage. This is called a wireframe.\nHowever, using pen and paper is quite inefficient, when you have a project involving many stakeholders.\nTop wireframe tools support project management.\nThe project example above is free for download, import and reuse for your own projects and is available through our\nSamples page .\nHow wireframe tools supports project management"
    },
    {
        "title": "Wireframe for Business – Use Wireframe Tools to Facilitate Your Product Design Process",
        "chunk_index": 1,
        "text": "Top wireframe tools make it possible to communicate ideas.By creating a wireframe you make ideas tangible, which makes it possible to discuss pros and cons with your team.\nTop wireframe tools supports collaboration. The way you collaborate in NinjaMock is inspired by Google Docs’ great commenting features.\nAs a result, NinjaMock features an intuitive and familiar way to leave comments on individual wireframes and to track their status.\nCollaboration on a project means that all users can access the project workspace and contribute to the project depending on their privileges.\nUsing wireframe tools enables you to share your company wireframes with relevant stakeholders and keep them up-to-date with the progress of the project.\nTools like NinjaMock also provide an opportunity to gain feedback from customers. You can invite a group of customers to test your wireframe. Via a unique link they can view and make comments directly on their own device.\nDuring the process of collaborating and user testing, you can easily make iterations to the wireframe. This ensures that you will reach the best possible solution.\n6 advantages of using wireframe tools for facilitating the product design proces\nSaves time and cut cost\n– Wireframe tools will save you time and money. They are fast to learn and easy to use by all project members. You create and iterate ideas and design the perfect user experience. You don’t want to commit expensive design and programming resources before your wireframe is completed.\nClear communication –"
    },
    {
        "title": "Wireframe for Business – Use Wireframe Tools to Facilitate Your Product Design Process",
        "chunk_index": 2,
        "text": "Having a wireframe layout increases clarity and facilitate communication, by making ideas tangible and shareable. Having a wireframe enables your team to discuss pros and cons of different ideas. Share your work with your clients in order to get instant feedback and ensure that everyone is up-to-date with the progression of the project.\nIdeation and collaboration –\nCollaboration and ideation goes hand in hand. The more stakeholders involved, the more ideas and perspectives come into play. This improves the ideation process and ensure that the best possible solution is created. Make sure that your wireframe tool supports collaboration.\nUser testing -\nSome wireframe tools offers the possibility to receive feedback from customers and users. This is a great way to discover potential problems with your initial design that needs to be reconsidered. Make sure that your wireframe tool support testing of the user experience in your app or website wireframe design – before having committed design and programming cost.\nProject management –\nusing a wireframe tool supports your role as a project manager. Assign privileges to your team members and stakeholders, depending their responsibilities in the project. Collaborate, like you may know it from Google Docs commenting features and track the status of individual wireframes.\nProject Alignment\n– Collaborating and communicating with clients and stakeholders throughout the design process, ensures that all parties agree on the final solution, as they have been involved in the entire process. From initial ideas to finished wireframe design.\nNinjaMock supports the product design process:"
    },
    {
        "title": "Wireframe for Business – Use Wireframe Tools to Facilitate Your Product Design Process",
        "chunk_index": 3,
        "text": "This is an overview over some of the specific\nfeatures\n, that supports you in the project manger role.\nReal time collaboration\n–\nNinjaMock allows you to share your workspace, and collaborate in real-time with with your team. Invite your business partners and colleagues to join your project and assign them privileges so they can contribute directly.\nYou can add as many collaborators as you want. Your team may be located at different offices or even in different countries, but this shouldn’t slow down the process. Real time collaboration makes collaboration faster and more effective.\nUser testing –\nWith a single click you can share your project with anyone. NinjaMock automatically generates a special secret link, which can then be used to open and view your project.The people you share this link with, do not need a NinjaMock account. This is particularly useful for submitting your work to your customers, who do not use wireframing tools, as they can still view the designs and make comments within the app.\nPage status –\nUse page status to keep track of your project. You might want to track the progress of your work in order to understand how near the project is to completion. In NinjaMock, you and your reviewers can control the statuses of individual pages. Every single page may have one of the following statuses “In progress” (default status), “Design complete” and “Approved”. This allows to keep an overview over the design process at any given time.\nManage team"
    },
    {
        "title": "Wireframe for Business – Use Wireframe Tools to Facilitate Your Product Design Process",
        "chunk_index": 4,
        "text": "– as a project owner, you have full control of your projects. Assign your collaborators as much or as little power over the project as you want: make them administrator, designer or reviewer. The\nAdministrator\nhas full control over folders and projects and can invite other collaborators. The\nDesigner\n, as one might expect, designs work in the project. However, this user will not be able to administer other users and their roles. The role with the fewest permissions is the\nReviewer\n. As the name explains, they can view the project and comment on it, but will not be able to design in the project and change the wireframe. Also, reviewers can not administer other users and their roles.\nWe hope that you got inspired to Start designing, using wireframe tools for collaborating!\nHappy Creating,\nThe NinjaMock Team"
    },
    {
        "title": "Samples – Wireframe examples created by Ninjas",
        "chunk_index": 0,
        "text": "Samples – Wireframe examples created by Ninjas\nMarch 16, 2018\nJamse\nNeed inspiration for your next project? Or just curious to see how your fellow Ninjas are designing in NinjaMock. We are launching a new Samples page with plenty of wireframe examples for your next project.\nGet inspired by wireframe examples from other Ninjas in\nSamples!\nView projects created in NinjaMock. Preview, download and import them into your own account and reuse all that you want.\nCheck it out!\nHaving a Samples page showcasing inspiring projects, has long been requested by current Ninjas and is now reality. We have selected our favourite public projects to inspire your creativity.\nAll FREE NinjaMock accounts are public, which means that any project created using a FREE account may be featured in this samples page and are available to fellow ninjas to download and use. Only projects created with PRO accounts are private.\nBy providing this Samples page we aim to make the wireframe creation process faster and easier, by providing wireframe examples for you to use and iterate to fit your own project. The overall goal of creating this Samples page is to strengthen the Ninja Community and inspire creation, sharing and contribution.\nWhat type of wireframe examples can I find in the Samples page?"
    },
    {
        "title": "Samples – Wireframe examples created by Ninjas",
        "chunk_index": 1,
        "text": "Within the Samples page you’ll find projects containing both Android and iPhone app wireframe examples as well as projects based on iPad, tablets, Windows, Freehand and browser designs. Use these and give yourself a head start designing your next project!\nDo you want to show your wireframe examples in thisSamples page?\nYou can submit your project and inspire fellow Ninjas with your wireframe examples showcased in our Samples page. We reward the best wireframe projects with a PRO subscription. Submit your project to:\nninjas@ninjamock.com\nStart Designing! Taking inspiration from the new\nWireframe Samples\nHappy Creating ,\nThe NinjaMock Team"
    },
    {
        "title": "NinjaMock – Introducing Wireframe Template pages!",
        "chunk_index": 0,
        "text": "NinjaMock – Introducing Wireframe Template pages!\nMarch 8, 2018\nJamse\nWireframe template pages have long been a requested feature in NinjaMock and thanks to you, it is now a reality.\nDear ninjas, We are happy to tell you that it is now possible to add wireframe template pages, when creating your projects within your NinjaMock design space. This means that you can get inspiration and try out ideas from fellow ninjas, that you would otherwise not have thought about yourself.\nYou find these template pages in the Pages section below the design canvas. Instead of adding a new blank page, you can now also choose to add different template pages suitable for your project.\nThanks for sharing you best wireframe template pages!\nwireframe Template pages have long been a requested\nfeature\nin NinjaMock and thanks to you, it is now a reality. A couple of weeks ago we asked our fellow ninjas to send us their best template pages to share with the rest of the community. Fortunately, a lot of you have chosen to share your work with us, and for that we are grateful. This means that we can continue to make NinjaMock even better for the whole ninja community.\nWhat kind of template pages can i choose from?"
    },
    {
        "title": "NinjaMock – Introducing Wireframe Template pages!",
        "chunk_index": 1,
        "text": "We are continuously adding more template pages within the Pages section, as we receive new template pages from our ninjas. At the time of writing this blog post, the current template pages include: app template pages such as iPad, Android and iPhone wireframe template pages, as well as regular website wireframe template pages.\nGet inspired and start designing your next awesome project.\nHappy creating ,\nThe NinjaMock Team\nWant to contribute?\nYou can contribute to the community by submitting your template page to:\nninjas@ninjamock.com\n. We reward ninjas who contribute, with a PRO subscription – if you are up for a challenge!"
    },
    {
        "title": "Want to start a business? – Use wireframing to go from idea to business -fast!",
        "chunk_index": 0,
        "text": "Want to start a business? – Use wireframing to go from idea to business -fast!\nMarch 2, 2018\nJamse\nIn this article we cover 5 important reasons why wireframing is a must starting your business, ranging from creating initial legitimacy, persuading collaborators, getting approval from customers, applying for funding and having a clear plan for realizing your business idea and bring it to market fast.\nWhy should I use wireframing starting a business?\nUsing wireframes is risk free. You only spend your time creating the wireframe and testing your idea, which allows you to know, whether the idea is worth realizing or not, without having spent money on designers, programmers etc. only to realize that there is no market for the given product. Wireframing gives an opportunity to test ideas, select the best one, and bring it to market fast, by having a clear vizualization of the future product.\nThe Power of visualization using wireframing\nVisualization is the greatest tool for creating anything. Visualizing an app or website idea through wireframing, is the first step in turning ideas into reality and to create trust in you as an entrepreneur and in your business idea. It is hard to reach goals without direction. Having a wireframe for your idea creates clarity about where you are going and makes next steps clear. Creating a wireframe makes your idea tangible and concrete. It becomes much easier for yourself and others to see it happen."
    },
    {
        "title": "Want to start a business? – Use wireframing to go from idea to business -fast!",
        "chunk_index": 1,
        "text": "Wireframing creates value for you throughout your entrepreneurial journey\nThroughout the entrepreneurial process wireframing creates value at different levels. Starting with nothing except an idea, using a wireframe is the first, the cheapest, the fastest, and the most effective and powerful tool that you can use. Here is why.\n5 good reasons why you must create a wireframe – starting your business\n1)Use wireframing to create initial legitimacy\nLegitimacy is the first resource any entrepreneur needs to establish in order to gain other resources. Having a wireframe makes your idea tangible and as close to real as one can get, during the early stage of the entrepreneurial process.\n2)Use your wireframe to persuade collaborators\nA wireframe makes your idea tangible, you can use it to persuade potential collaborators to work with you. You need to make them believe that it can happen. By visualizing the end product, you can start imagining together and get them excited about working to realize the idea. Wireframing also creates common ground for further developing the idea within the new team and eliminates any potential confusion.\n3)Get your customers approval – before creating"
    },
    {
        "title": "Want to start a business? – Use wireframing to go from idea to business -fast!",
        "chunk_index": 2,
        "text": "Through NinjaMock wireframe tool you can test and get feedback from potential future customers. Through invitation they can make comments to your app or website idea within the NinjaMock application. This let’s you know if you are on the right track or if anything needs to be changed, before spending money on designers and programmers. It also allow you to create the best possible end product for your customers.\n4)Use wireframing it to get funding\nWhen potential investors ask the famous question\n“have you asked your customers?”\nYou can smile and say yes, and add any positive user comments, that you have received during user testing. This is a very powerful tool for persuasion. Just think about it, would you invest your own money in any new ideas without having an indicator, that this was likely to result in a return on investment? Probably not. Having a tangible wireframe, that has already been tested by future customers with positive response, is a very good indicator that this idea may be worth investing in.\n5)Realizing your idea through wireframing"
    },
    {
        "title": "Want to start a business? – Use wireframing to go from idea to business -fast!",
        "chunk_index": 3,
        "text": "Once you have either gotten funding or bootstrapped your way to carry through with your idea. You have an app- or website design approved by future customers, which you can export and send to a designer and programmer. Having the clarity of what you want saves them time, which means saving you money. You can also upload the wireframe on platforms such as 99designs.com and receive several offers and design suggestions, choosing the one that you like best, like one of the current users describe in her success story,\nmy first wireframe.\nRealize your business idea. Start designing!\nGood luck ,\nThe NinjaMock Team"
    },
    {
        "title": "NinjaMock | Why Mockup?",
        "chunk_index": 0,
        "text": "NinjaMock | Why Mockup?\nFebruary 23, 2018\nJamse\nAt NinjaMock we encourage everyone with great ideas to start executing these and bring them into life, by using NinjaMock to visualize mobile app and web page ideas, taking the first crucial step in transforming an abstract idea into a tangible wireframe and mockup design and put it to market – fast.\nEverything in this world is man-made. This is a chance for you, to leave your mark on the world, and have fun while seeing your ideas come into life.\nSo what are you waiting for? Feed your creative Ninja and start creating your mockup today, simply for:\nThe joy of creating\nThe joy of realizing your idea\nThe joy of sharing and inspiring others with your idea\nThe joy of collaborating with others during the online mockup process\nThe joy of continuously developing your design skills\nThe joy of creating great user flows and receiving user feedback, with a clickable mockup\nThe joy of improving your work and save time\nAt NinjaMock we strive to provide an easy mockup tool, simple to use, yet powerful.\nWe want to provide an environment of playful creation to unleash your inner Ninja and pursue your greatest dreams.\nPlease send us your mockup to:\nninjas@ninjamock.com\nmarked “ninja creator community”, We will showcase the best success stories. We love seeing the amazing things, that people are able to create using NinjaMock. It is truly inspiring!"
    },
    {
        "title": "NinjaMock | Why Mockup?",
        "chunk_index": 1,
        "text": "For inspiration you can read,\nmy first wireframe\n,\nan example of a user succes story.\nHappy creating,\nThe NinjaMock Team"
    },
    {
        "title": "MY FIRST WIREFRAME | Ninja Creator Community",
        "chunk_index": 0,
        "text": "MY FIRST WIREFRAME | Ninja Creator Community\nFebruary 16, 2018\nJamse\nShare your own success story\nSend it to:\nninjas@ninjamock.com\nAttach relevant images and mark it “Ninja Creator Community”\nHow creating a wireframe became the beginning of my entrepreneurial journey\nI am a person with many ideas, but I have kept them in my mind for a very long time, too long, only writing them down on paper and in notebooks, however, nothing had materialized, until I created my first wireframe mockup.\nMaking the decision to create my first wireframe mockup for my app- and website idea, was the best decision I have made, in the process of turning an idea into reality and becoming an entrepreneur.\nHaving created my wireframe design was a “wow” experience. I felt proud, looking at my accomplishments.\nHaving a mockup also gave me the opportunity to take the next step and find interest groups and places, where I believed that my future customers would be, and invite them to give feedback on my online wireframe mockup.\n“This was the most amazing feeling ever, going from idea, to mockup, to finished app. All of this, taking place in much faster pace than I ever could have imagined. And it made me think, “what else can I create?”"
    },
    {
        "title": "MY FIRST WIREFRAME | Ninja Creator Community",
        "chunk_index": 1,
        "text": "This gave me valuable insights and made me come up with the final wireframe and mockup design, already approved by my future users and customers. Having this feedback gave me confidence enough to take the next step and upload my wireframe mockup and design criteria to the platform 99designs.com – a platform, where designers and coders give you offers on your project. I found a design that I liked and got it coded. This was the most amazing feeling ever, going from idea, to wireframe, to finished app. All of this, in much faster pace than I ever could have imagined. And it made me think; “what else can I create?”\nBut mostly I felt proud about my decision to, finally, turn one of my ideas into reality thinking, “why did I not make this decision before?” . Well, part of it had to do with the fact that, I did not know that platforms such as NinjaMock existed, where you can visualize ideas through wireframes. Also, as I am not a designer or a coder, I did not encounter the term “wireframe” and “mockup” before starting to participate in various entrepreneurship events , where the power of visualization and pitching ideas is crucial, for entrepreneurs looking for funding.\n“Experimenting and playing around with different wireframe designs, made me build confidence, and made me believe, that this could really be something”\nSo"
    },
    {
        "title": "MY FIRST WIREFRAME | Ninja Creator Community",
        "chunk_index": 2,
        "text": "creating my first wireframe became a crucial step taking the plunge into entrepreneurship. The the process of visualization, experimenting and playing around with different wireframe designs, gave me clarity and made me believe, that this could really be something, feeling excited moving forward.\nTherefore I warmly encourage anyone walking around with ideas in their minds, to begin turning these ideas into reality – it is the best feeling ever.\nBest of luck ,\nAnna\nShare your own success story\nSend it to:\nninjas@ninjamock.com\nAttach relevant images and mark it “Ninja Creator Community”\nNew to NinjaMock?"
    },
    {
        "title": "NinjaMock Recognized as a Leader",
        "chunk_index": 0,
        "text": "NinjaMock Recognized as a Leader\nDecember 12, 2017\nJamse\nNinjaMock has been identified as one of the best Danish software tech companies, based on its high levels of customer satisfaction and likeliness to recommend ratings from real G2 Crowd users.\nNinjaMock has received a 4.5 out of 5 star average for user satisfaction for its\nwireframing\nplatform across its 25 verified user reviews. Real users point to the platform’s ease of setup and its ease of admin (each at ninety-eight percent) as two of the best features of the Denmark company.\nThe state of Denmark report recognized\nNinjaMock\nand seven other Danish SaaS companies as the leaders of the country’s tech scene. Overall the report covered 26 companies amounting to over $260,000,000 in VC funding."
    },
    {
        "title": "Using wireframing to cut costs and improve processes",
        "chunk_index": 0,
        "text": "Using wireframing to cut costs and improve processes\nOctober 12, 2017\nJamse\nThis is a surprisingly contentious debate, and an important one that determines where the development budget gets spent. Nonetheless, let’s take a few moments to make sure we’re all on the same page before we get into the ‘meat’ of it.\nWhat is wireframing?\nA wireframe is a sketch or visual depiction of what a web page or mobile app will look like. They are sometimes called ‘screen blueprints’ or ‘page schematics’ as well. They are used to establish the core elements of a web page’s visual design and functionality – to set down what it will look like and what it will do. It can then be passed on to the designers, developers, copy writers, customers and anyone else involved in the project.\nWireframing, then, is the process of building your wireframe. It means establishing the core functions of your website, the way these functions will be displayed, and the basics of how the user will interact with the site in general. It is (or rather it can be) the first step in virtually all the core processes of website design – visual design, UE, SEO and even organising the actual text.\nWhat does wireframing achieve?\nAt its core, the process of wireframing is about saving time, effort and expense."
    },
    {
        "title": "Using wireframing to cut costs and improve processes",
        "chunk_index": 1,
        "text": "As they say, a picture is worth 1000 words. What wireframes really achieve is getting all of your creative and business stakeholders ‘on the same page’ at the very beginning of a project.\nWhether this is achieved by getting them all together to produce the initial wireframe (preferable) or simply having a meeting where they are presented with a completed wireframe before they begin thinking about the project in detail (still quite useful), the process can virtually eliminate the wasted effort that results when your ‘UE guy’ starts working on something inherently incompatible with the template your web designer is producing, and neither of their concepts support the text your marketing team wrote.\nIt is always worth a small investment of time and effort to get everyone in the same room and brainstorming together, even if you can only spare a few hours. Then they are all actually working on the\nsame\nproject, rather than 4 different, incompatible visions.\nWhen is the right time to wireframe?"
    },
    {
        "title": "Using wireframing to cut costs and improve processes",
        "chunk_index": 2,
        "text": "Simply put, the sooner the better. Every project should start with a low resolution wire frame, even if it is drawn on the proverbial ‘back of a serviette’. As soon as you get the idea for an app, web page or just about anything else that is both visual and interactive, you need to start wireframing. It will not only help to ‘ground’ your ideas in practical, visual terms, it will establish a core idea which all other work can be made in accordance with, or which can be changed to fit necessity in a way that all the other stakeholders can quickly be made aware of.\nWhen is the right time to stop wireframing?\nHere there are 2 schools of thought. Some processes stop wireframing as soon as the coders or UE specialists start producing prototypes and mock-ups. Others keep making updated wireframes to distribute to the rest of the team all the way up until the site or app is coded and put to bed. In either case, keep using wireframes until the issues they represent are decided and finalised.\nWho needs to have access to (and input on) these wireframes?\nJust about everyone on your project!\nAccess to the latest wireframe is vital to anyone working on the project, so they can avoid wasting time on features that won’t work, or won’t work the way they had envisioned."
    },
    {
        "title": "Using wireframing to cut costs and improve processes",
        "chunk_index": 3,
        "text": "As to the ability to modify wireframes, if you have very large teams, you might do better to only give specific team leaders the ability to alter wireframes or generate new versions. Even then, consider having all modification be made in a meeting with all available stakeholders, so as not to ruin the work of an entire team by making changes they were not aware of.\nThe more the individuals or teams involved in different aspects of your project actively collaborate, the more efficient your project will become. The more you test, review feedback and make iterations as a group, the better the final product.\nHow do wireframes impact your process?\nWireframes serve to focus all of your efforts on the same deliverables. They let you test different approaches rapidly, and generate nearly immediate feedback. In the end, the time and effort you invest in wireframing will be repaid several times, especially on larger or more involved projects.\nWhat could skipping wireframes entirely cost you?\nThe short answer is, as always, ‘that depends on what you are working on’. Realistically, though, we’ve been in the business long enough to give you a real answer, based on averaging the various projects we’ve been involved with over the years."
    },
    {
        "title": "Using wireframing to cut costs and improve processes",
        "chunk_index": 4,
        "text": "Wireframing is typically 5-6% of your total development budget. However, it enhances the effectiveness of almost every other aspect of your work. For example: On average the final costs for coding are 60% less for well wireframed projects. RFC (Request For Change) costs typically drop by 80%.\nWhat that means for you is that even if it were to cost 3-4 TIMES what it really does to wireframe, you’d be saving time and money by doing it.\nMaking the most of a limited wireframe budget\nThere are a few tips and tricks we can present for doing good wireframing, even if the bean-counters don’t appreciate its real importance:\nChoose a wireframe tool that is easy to use, or one that you already know how to use well. This will save you time getting up to speed.\nCreate multiple variations, especially early on. This will let you eliminate unworkable arrangements quickly.\nGet key stakeholders involved early, and incorporate their feedback into new versions.\nConduct user testing to determine if your wireframe will be usable by your intended audience or market.\nGenerate new iterations for the wireframe until all key stakeholders are satisfied (or resigned to compromise).\nMake sure you won’t have to go ‘back to the drawing board’ after design or coding has started."
    },
    {
        "title": "NinjaMock. Most interesting features",
        "chunk_index": 0,
        "text": "NinjaMock. Most interesting features\nMay 8, 2017\nJamse\nIn this article we describe the most interesting features and what makes NinjaMock better than other applications for wireframing and prototyping.\nClick picture to view video\nFull free version\nWe all love free apps, especially if they are good free apps ?? So we decided to make NinjaMock free for non-commercial use, forever. This distinguishes us positively compared to competitors who limit their free versions or only supply time limited trials. We decided not to impose any restrictions on the functionality of our editor. The free version is available for all: an unlimited number of pages in the projects, export to PDF, HTML and PNG, support comments, use master pages, full real time collaboration, etc.\nWe can afford the luxury for two reasons. Firstly, we don’t have an investor and therefore we have the freedom to decide what to do. Secondly, thanks to a competent approach of building applications that support our infrastructure, our project costs are low.\nPaper style\nWe believe that efficient prototyping must be done as wireframes.\nIt’s inefficient to begin prototyping with realistic elements and high-fidelity design. Having years of design and development experience, we’ve handcrafted the most optimal and efficient prototyping process for you.\nWe master the intricacies of the process – from sketchy prototyping to the final design. As a result, we have reached a zen-perfection in creating to-the-point “paper” prototypes."
    },
    {
        "title": "NinjaMock. Most interesting features",
        "chunk_index": 1,
        "text": "Elements\nWe support the following platforms:\nCustom controls used in the creation of prototypes are done as vectors, but this is not a surprise these days. But there is an interesting feature: All items are made in NinjaMock. We provide basic vector tools needed when prototyping, such as a rectangle, ellipse, line, polygon, polyline, Bezier curves, and a pencil to draw by hand.\nWhat this means for you is that if you are missing an item or icons, you can easily draw it yourself.\nClick picture to view video\nChange zoom\nWe have implemented a unique technology for rendering using HTML5 canvas, which allows us to make fully functional zoom.\nZooming on the wireframe\nReal time collaboration\nCollaboration is natural when you work with wireframes. And this has always been a part of NinjaMock. Now we have upgraded this feature so you can share the canvas and in real time add, change and review your project in your group.\nSo invite people to you project and get rid of emails, screenshots and a lot of waiting. As you see, collaboration in real time is made Ninja easy. You will benefit by completing your work even faster.\nComments"
    },
    {
        "title": "NinjaMock. Most interesting features",
        "chunk_index": 2,
        "text": "Google Docs has, in particular, a great function – Comment. Therefore, when developing similar functionality in NinjaMock, we learned by example from Google Docs. As a result, we now have an intuitive and familiar way of commenting in all prototypes – with support to responses of comments, comments status changes, as well as e-mail notifications.\nAdditionally, we added the ability to attach status of individual pages in your project (In progress, Completed, Approved). This allows you to easily determine how close to completion your design is.\nAnd on the project overview page you can see the status of each of your projects:\nSharing\nIn NinjaMock you can send your prototype to your client (or somebody else) to get review and feedback. You only need to open access of you the project (by clicking on the share) and send a link. And then we went a little further, with the generated QR-code, you can run the prototype application directly on your device and see how it will work.\nScan the QR code – it’s real ??\nThe important point is that you can choose status, and which pages that will be available for viewing. For example, you can send only completed, but yet approved pages.\nExports and navigation on paper\nWe noticed that many design teams had their office walls covered with printed pages and prototypes of the final design. Some teams use them for inspiration, and some discuss and write notes directly on the wall."
    },
    {
        "title": "NinjaMock. Most interesting features",
        "chunk_index": 3,
        "text": "NinjaMock have the ability to export to PDF and PNG, with the ability to print the comments and links on the page. We call it “paper navigation” including a footnote, with the page number on which the link leads to:\nOrganization of pages and projects\nIn complex projects, there is a need for streamlining pages – for example, group them logically (registration page, edit the profile page of the village, etc.), or simply to display a set of states of a page (the normal state, the same page, second stage with a dialogue dialog box, etc.).\nMany of our competitors allow you to create a page tree. We talked with many designers and few were able to explain what it meant when one page is a subsidiary of another – everyone understands it differently. Instead, we decided to use a familiar experience of using PowerPoint, showing thumbnails of pages for faster and easier navigation.\nYou can logically organize your project by creating groups of pages. You can can create an unlimited number of groups.\nFor projects in NinjaMock we reproduced the experience of working with files on your computer: Projects can be grouped into folders, folders can be dragged to other folders, etc. It is your own file system in the cloud!\nTeam"
    },
    {
        "title": "NinjaMock. Most interesting features",
        "chunk_index": 4,
        "text": "NinjaMock has a built team management for organizations. Administrators can add and delete users, and assign them different roles and rights. You can choose one of three roles (Administrator, Designer, Reviewer). As an administrator, you have full control of your projects. They are stored and maintained with the company account and so you never again have to fear losing your projects.\nThis is just a small list of what can NinjaMock. If you want to know more of the application – go to the site and start prototyping\nninjamock.com\n!\nTells us what you think\nWhat do you think of NinjaMock? Leave us a comment, or email us at\nninjas@ninjamock.com"
    },
    {
        "title": "Introducing tutorial videos",
        "chunk_index": 0,
        "text": "Introducing tutorial videos\nMay 1, 2017\nJamse\nOne of the most sought-after feature requests in NinjaMock are tutorial videos; Small videos that show how to use specific features in NinjaMock.\nWell, we have listened to your requests – and have started rolling out the first videos.\nThe videos are available from within the designer (bottom right corner). This makes it easy to access the specific tutorial you need while working on your mockup.\nIt is also possible to access the videos without logging in to NinjaMock, as we have added a link directly from the top-menu to the video page.\nAnd they can obviously also be found on our YouTube channel (have you subscribed yet?).\nWe will be bringing out more videos in the near future. If you have a specific feature that you would like us to cover, then please let us know in the comments below."
    }
]